app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'davidson'
OR `username` = 'davidson'
 LIMIT 1
---
    public function attemptLogin()
    {
        $userModel = new UserModel();
        $emailOrUsername = $this->request->getPost('email'); // Form login akan pakai field 'email'
        $password = $this->request->getPost('password');

        // Cari user berdasarkan email atau username
        $user = $userModel->where('email', $emailOrUsername)
                          ->orWhere('username', $emailOrUsername)
                          ->first();